burakenez/gd32e51x-demo-suites-cmake-vscode/Drivers/GD32E51x_standard_peripheral/Source/gd32e51x_dac.c
    if(DAC_OUT0 == dac_out){
        /* get the DACx_OUT0 output FIFO number */
        number = (uint16_t)((uint16_t)DAC_STAT1(dac_periph) >> 4U);
    }else if(DAC_OUT1 == dac_out){
        /* get the DACx_OUT1 output FIFO number */
        number = (uint16_t)(DAC_STAT1(dac_periph) >> 20U);
    }else{
        /* illegal parameters */
    }

    return number;
}

/*!
    \brief      get the DAC flag
    \param[in]  dac_periph: DACx(x=0,1)
    \param[in]  flag: the DAC status flags, only one parameter can be selected which is shown
                as below:
      \arg        DAC_FLAG_DDUDR0: DAC_OUT0 DMA underrun flag
      \arg        DAC_FLAG_FIFOF0: DAC_OUT0 FIFO full flag
      \arg        DAC_FLAG_FIFOE0: DAC_OUT0 FIFO empty flag
      \arg        DAC_FLAG_FIFOOVR0: DAC_OUT0 FIFO overflow flag
      \arg        DAC_FLAG_FIFOUDR0: DAC_OUT0 FIFO underflow flag
      \arg        DAC_FLAG_DDUDR1: DAC_OUT1 DMA underrun flag
      \arg        DAC_FLAG_FIFOF1: DAC_OUT1 FIFO full flag
      \arg        DAC_FLAG_FIFOE1: DAC_OUT1 FIFO empty flag
      \arg        DAC_FLAG_FIFOOVR1: DAC_OUT1 FIFO overflow flag
      \arg        DAC_FLAG_FIFOUDR1: DAC_OUT1 FIFO underflow flag
    \param[out] none
    \retval     the state of DAC bit(SET or RESET)
*/
FlagStatus dac_flag_get(uint32_t dac_periph, uint32_t flag)
{
    if(flag & DAC_STAT_FLAG_MASK0){
        /* check DAC_STAT0 flag */
        if(RESET != (DAC_STAT0(dac_periph) & flag)){
            return SET;
        }else{
            return RESET;
        }
    }else if(flag & DAC_STAT_FLAG_MASK1){
        /* check DAC_STAT1 flag */
        if(RESET != (DAC_STAT1(dac_periph) & flag)){
            return SET;
        }else{
            return RESET;
        }
    }else{
        /* illegal parameters */
        return RESET;
    }
}

/*!
    \brief      clear the DAC flag
    \param[in]  dac_periph: DACx(x=0,1)
    \param[in]  flag: DAC flag
                one or more parameter can be selected which are shown as below:
      \arg        DAC_FLAG_DDUDR0: DACx_OUT0 DMA underrun flag
      \arg        DAC_FLAG_FIFOOVR0: DACx_OUT0 FIFO overflow flag
      \arg        DAC_FLAG_FIFOUDR0: DACx_OUT0 FIFO underflow flag
      \arg        DAC_FLAG_DDUDR1: DACx_OUT1 DMA underrun flag
      \arg        DAC_FLAG_FIFOOVR1: DACx_OUT1 FIFO overflow flag
      \arg        DAC_FLAG_FIFOUDR1: DACx_OUT1 FIFO underflow flag
    \param[out] none
    \retval     none
*/
void dac_flag_clear(uint32_t dac_periph, uint32_t flag)
{
    if(flag & DAC_STAT_FLAG_MASK0){
        /* check DAC_STAT0 flag */
        DAC_STAT0(dac_periph) = (uint32_t)(flag & DAC_STAT_FLAG_MASK0);
    }else{
        /* illegal parameters */
    }

    if(flag & DAC_STAT_FLAG_MASK1){
        /* check DAC_STAT1 flag */
        DAC_STAT1(dac_periph) = (uint32_t)(flag & DAC_STAT_FLAG_MASK1);
    }else{
        /* illegal parameters */
    }
}

/*!
    \brief      enable DAC interrupt
    \param[in]  dac_periph: DACx(x=0,1)
    \param[in]  interrupt: the DAC interrupt
                one or more parameter can be selected which are shown as below:
      \arg        DAC_INT_DDUDR0: DACx_OUT0 DMA underrun interrupt
      \arg        DAC_INT_FIFOOVR0: DACx_OUT0 FIFO overflow interrupt
      \arg        DAC_INT_FIFOUDR0: DACx_OUT0 FIFO underflow interrupt
      \arg        DAC_INT_DDUDR1: DACx_OUT1 DMA underrun interrupt
      \arg        DAC_INT_FIFOOVR1: DACx_OUT1 FIFO overflow interrupt
      \arg        DAC_INT_FIFOUDR1: DACx_OUT1 FIFO underflow interrupt
    \param[out] none
    \retval     none
*/
void dac_interrupt_enable(uint32_t dac_periph, uint32_t interrupt)
{
    if(interrupt & DAC_INT_EN_MASK0){
        /* enable underrun interrupt */
        DAC_CTL0(dac_periph) |= (uint32_t)(interrupt & DAC_INT_EN_MASK0);
    }else{
        /* illegal parameters */
    }
    
    if(interrupt & DAC_INT_EN_MASK1){
        /* enable FIFO overflow or underflow interrupt */
        DAC_CTL1(dac_periph) |= (uint32_t)(interrupt & DAC_INT_EN_MASK1);
    }else{
        /* illegal parameters */
    }
}

/*!
    \brief      disable DAC interrupt
    \param[in]  dac_periph: DACx(x=0,1)
    \param[in]  interrupt: the DAC interrupt
                one or more parameter can be selected which are shown as below:
      \arg        DAC_INT_DDUDR0: DACx_OUT0 DMA underrun interrupt
      \arg        DAC_INT_FIFOOVR0: DACx_OUT0 FIFO overflow interrupt
      \arg        DAC_INT_FIFOUDR0: DACx_OUT0 FIFO underflow interrupt
      \arg        DAC_INT_DDUDR1: DACx_OUT1 DMA underrun interrupt
      \arg        DAC_INT_FIFOOVR1: DACx_OUT1 FIFO overflow interrupt
      \arg        DAC_INT_FIFOUDR1: DACx_OUT1 FIFO underflow interrupt
    \param[out] none
    \retval     none
*/
void dac_interrupt_disable(uint32_t dac_periph, uint32_t interrupt)
{
    if(interrupt & DAC_INT_EN_MASK0){
        /* disable underrun interrupt */
        DAC_CTL0(dac_periph) &= (uint32_t)(~(interrupt & DAC_INT_EN_MASK0));
    }else{
        /* illegal parameters */
    }

    if(interrupt & DAC_INT_EN_MASK1){
        /* disable FIFO overflow or underflow interrupt */
        DAC_CTL1(dac_periph) &= (uint32_t)(~(interrupt & DAC_INT_EN_MASK1));
    }else{
        /* illegal parameters */
    }
}

/*!
    \brief      get the DAC interrupt flag
    \param[in]  dac_periph: DACx(x=0,1)
    \param[in]  int_flag: DAC interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        DAC_INT_FLAG_DDUDR0: DACx_OUT0 DMA underrun interrupt flag
      \arg        DAC_INT_FLAG_FIFOOVR0: DACx_OUT0 FIFO overflow interrupt flag
      \arg        DAC_INT_FLAG_FIFOUDR0: DACx_OUT0 FIFO underflow interrupt flag
      \arg        DAC_INT_FLAG_DDUDR1: DACx_OUT1 DMA underrun interrupt flag
      \arg        DAC_INT_FLAG_FIFOOVR1: DACx_OUT1 FIFO overflow interrupt flag
      \arg        DAC_INT_FLAG_FIFOUDR1: DACx_OUT1 FIFO underflow interrupt flag
    \param[out] none
    \retval     the state of DAC interrupt flag(SET or RESET)
*/
FlagStatus dac_interrupt_flag_get(uint32_t dac_periph, uint32_t int_flag)
{
    uint32_t reg1 = 0U, reg2 = 0U;

