burakenez/gd32e51x-demo-suites-cmake-vscode/Drivers/GD32E51x_standard_peripheral/Source/gd32e51x_dac.c
    if(int_flag & DAC_INT_FLAG_MASK0){
        /* check underrun interrupt int_flag */
        reg1 = DAC_STAT0(dac_periph) & int_flag;
        reg2 = DAC_CTL0(dac_periph) & int_flag;
    }else if(int_flag & DAC_INT_FLAG_MASK1){
        /* check FIFO overflow and underflow interrupt int_flag */
        reg1 = DAC_STAT1(dac_periph) & int_flag;
        reg2 = DAC_CTL1(dac_periph) & int_flag;
    }else{
        /* illegal parameters */
    }

    /*get DAC interrupt flag status */
    if((RESET != reg1) && (RESET != reg2)){
        return SET;
    }else{
        return RESET;
    }
}

/*!
    \brief      clear the DAC interrupt flag
    \param[in]  dac_periph: DACx(x=0,1)
    \param[in]  int_flag: DAC interrupt flag
                one or more parameter can be selected which are shown as below:
      \arg        DAC_INT_FLAG_DDUDR0: DACx_OUT0 DMA underrun interrupt flag
      \arg        DAC_INT_FLAG_FIFOOVR0: DACx_OUT0 FIFO overflow interrupt flag
      \arg        DAC_INT_FLAG_FIFOUDR0: DACx_OUT0 FIFO underflow interrupt flag
      \arg        DAC_INT_FLAG_DDUDR1: DACx_OUT1 DMA underrun interrupt flag
      \arg        DAC_INT_FLAG_FIFOOVR1: DACx_OUT1 FIFO overflow interrupt flag
      \arg        DAC_INT_FLAG_FIFOUDR1: DACx_OUT1 FIFO underflow interrupt flag
    \param[out] none
    \retval     none
*/
void dac_interrupt_flag_clear(uint32_t dac_periph, uint32_t int_flag)
{
    /* clear underrun interrupt int_flag */
    if(int_flag & DAC_INT_FLAG_MASK0){
        DAC_STAT0(dac_periph) = (uint32_t)(int_flag & DAC_INT_FLAG_MASK0);
    }else{
        /* illegal parameters */
    }

    /* check FIFO overflow and underflow interrupt int_flag */
    if(int_flag & DAC_INT_FLAG_MASK1){
        DAC_STAT1(dac_periph) = (uint32_t)(int_flag & DAC_INT_FLAG_MASK1);
    }else{
        /* illegal parameters */
    }
}
